tsung_logs/posts-t3micro-dbi-noabort/simple.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="15000" use_controller_vm="true"/>
  </clients>
  <servers>
    <server host="jnlai-t3micro-dbi-2.3hfpeaqsam.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>
  <load>
    <arrivalphase duration="15" phase="1" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase duration="15" phase="2" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="Make Post" probability="100" type="ts_http">
      <transaction name="Get_Root">
        <request>
          <http url="/"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Get_Register">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url="/register"/>
        </request>
      </transaction>
      <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      <setdynvars length="30" sourcetype="random_string">
        <var name="rnd_email"/>
      </setdynvars>
      <setdynvars length="30" sourcetype="random_string">
        <var name="rnd_user"/>
      </setdynvars>
      <thinktime random="true" value="2"/>
      <transaction name="Post_Register">
        <request subst="true">
         <http content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_rnd_email%%@gmail.com&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Sign+up" method="POST" url="/"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Redirect_Root">
        <request>
          <http url="/"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <setdynvars end="30" sourcetype="random_number" start="1">
        <var name="random_book_id"/>
      </setdynvars>
      <transaction name="Get_Book">
        <request subst="true">
          <http url="/books/%%_random_book_id%%"/>
        </request>
      </transaction>
      <thinktime random="true" value="2"/>
      <transaction name="Get_New_Post">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url="/posts/new"/>
        </request>
      </transaction>
      <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end." sourcetype="eval">
        <var name="authenticity_token"/>
      </setdynvars>
      <transaction name="Post_New_Post">
        <request subst="true">
          <dyn_variable name="post_id" re="Location: http://.*/posts/(.*)\r"/>
          <http url="/posts" contents="authenticity_token=%%_authenticity_token%%&amp;post%5Btitle%5D=tsung_post_title&amp;post%5Bcontent%5D=tsung_post_content&amp;post%5Bbook_id%5D=%%_random_book_id%%&amp;" method="POST"/>
        </request>
      </transaction>
      <thinktime random="true" value="4"/>
      <transaction name="Redirect_To_New_Post">
        <request subst="true">
          <http url="/posts/%%_post_id%%"/>
        </request>
      </transaction>
    </session>
  </sessions>
</tsung>